Картриджи/src/Catalogs/Принтера/Принтера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Принтера</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Производители</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеИзображение</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
</mdclass:Catalog>

Картриджи/src/Enums/ВидыДополнительнойИнформацииОбъектов/ВидыДополнительнойИнформацииОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДополнительнойИнформацииОбъектов</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>Файл</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Изображение</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

Картриджи/src/Catalogs/МоделиКартриджей/МоделиКартриджей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МоделиКартриджей</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Производители</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеИзображение</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Принтера</name>
    <attributes>
      <name>Принтер</name>
      <type>
        <types>CatalogRef.Принтера</types>
      </type>
    </attributes>
    <attributes>
      <name>Производитель</name>
      <type>
        <types>CatalogRef.Производители</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Картриджи/src/Catalogs/Файлы/Файлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Файлы</name>
  <attributes>
    <name>ВидДанных</name>
    <comment>Вид данных</comment>
    <type>
      <types>EnumRef.ВидыДополнительнойИнформацииОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <comment>Имя файла</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектХранилища</name>
    <type>
      <types>CatalogRef.Принтера</types>
      <types>CatalogRef.ОбслуживаниеПринтеров</types>
      <types>CatalogRef.МоделиКартриджей</types>
    </type>
  </attributes>
  <attributes>
    <name>Хранилище</name>
    <comment>Хранилище</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстФайла</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Картриджи/src/Catalogs/Принтера/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура УстановитьОсновноеИзображение(ОсновноеИзображение,СсылкаНаОбъект)
	
	СпрвочникОбъект = СсылкаНаОбъект.ПолучитьОбъект();
	Если ЗначениеЗаполнено(ОсновноеИзображение.ИмяФайла) Тогда
		СпрвочникОбъект.ОсновноеИзображение = ОсновноеИзображение;
	Иначе	
		СпрвочникОбъект.ОсновноеИзображение = Неопределено;	
	КонецЕсли;
	СпрвочникОбъект.Записать();
	
	ЗначениеВРеквизитФормы(СпрвочникОбъект, "Объект");

КонецПроцедуры // УстановитьКартинку() 

&НаСервере
Процедура УстановитьКартинку(ОсновноеИзображение)
	
	Если ЗначениеЗаполнено(ОсновноеИзображение.ИмяФайла) Тогда
		КартинкаАдрес = ПолучитьНавигационнуюСсылку(ОсновноеИзображение,"Хранилище");
	Иначе	
		КартинкаАдрес = "";	
	КонецЕсли; 
	
	Элементы.Картинка.РазмерКартинки = РазмерКартинки.АвтоРазмер;

КонецПроцедуры // УстановитьКартинку() 

&НаСервере
Процедура ВывестиСписокПринтеров()
	
	Запрос=Новый Запрос(
	"ВЫБРАТЬ
	|	МоделиКартриджейПринтера.Ссылка
	|ИЗ
	|	Справочник.МоделиКартриджей.Принтера КАК МоделиКартриджейПринтера
	|ГДЕ
	|	МоделиКартриджейПринтера.Принтер = &Принтер");
	Запрос.УстановитьПараметр("Принтер",ЭтаФорма.Объект.Ссылка);
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Сообщить(Выборка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры
     
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВывестиСписокПринтеров();
	
	УстановитьКартинку(Объект.ОсновноеИзображение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьОсновноеИзображение" Тогда
		
		Если ТипЗнч(Параметр) = Тип("Структура") Тогда
			
			Если Параметр.Свойство("ОбъектХранилища") Тогда
				
				Если Параметр.ОбъектХранилища = Объект.Ссылка Тогда
					
					УстановитьОсновноеИзображение(Параметр.ОсновноеИзображение, Объект.Ссылка);	
									
					УстановитьКартинку(Параметр.ОсновноеИзображение);
				
				КонецЕсли;                                         			
			
			КонецЕсли;                                             		
		
		КонецЕсли;                              	
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Изображения(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ТекстВопроса = "Для выполнения данной операции необходимо записать элемент. Записать?";		
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда			
			Попытка
				Записать();
			Исключение
				Сообщить(ОписаниеОшибки());
				Возврат;
			КонецПопытки;
		КонецЕсли;
	
	КонецЕсли;    
	
	Отбор = Новый Структура;
	Отбор.Вставить("ОбъектХранилища",Объект.Ссылка);
	Отбор.Вставить("ВидДанных"      ,ПредопределенноеЗначение("Перечисление.ВидыДополнительнойИнформацииОбъектов.Изображение"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор"              ,Отбор);  	
	ПараметрыФормы.Вставить("ОсновноеИзображение",Объект.ОсновноеИзображение);
	ПараметрыФормы.Вставить("ОбъектХранилища"    ,Объект.Ссылка);
			
	ОткрытьФорму("Справочник.Файлы.Форма.ФормаСпискаИзображений",ПараметрыФормы,ЭтаФорма,УникальныйИдентификатор,ВариантОткрытияОкна.ОтдельноеОкно); 	
	
КонецПроцедуры
